[{"term":"TIPOS iPv6","definition":"UNICAST ANYCAST MULTICAST"},{"term":"IPv4 que é utilizado no TCP/I","definition":"realizar a comunicação entre dois dispositivos na interne 32 BITS DE COMPRIMENTO"},{"term":"IPv6 128 bits de comprimento","definition":"IPv6 é representado na\nforma de 32 dígitos hexadecimais"},{"term":"UNICAST -","definition":"identificar unicamente uma interface de\nrede ou seja são utilizados para permitir a comunicação\nentre dois nós exclusivos da rede, tais como PCs, Tablets, Telefones IP, etc."},{"term":"MULTICAST -","definition":"um endereço IP que designa um grupo de interfaces ou seja Um endereço multicast permite que uma cópia dos dados seja enviada à rede para que\nvários destinatários recebam os mesmos, ao invés de uma cópia para cada um dos destinos. Isto\neconomiza, e muito o tráfego em uma rede, visto que não é necessária a duplicação do tráfego"},{"term":"ANYCAST -","definition":"utilizado para identificar um grupo de interfaces mas diferente do Multicas o pacote destinado à um endereço Anycast é entregue somente à interface\nmais próxima da origem, enquanto o Multicast entrega a todos os participantes do grupo, ou seja,\nqualquer endereço Unicast aplicado à mais de uma interface automaticamente torna-se um\nendereço Anycast, com a única diferença de que a configuração deve explicitamente indicar que foi\natribuído um endereço Anycast"},{"term":"Cabeçalho do IPv6","definition":"O IPv6 introduz um novo formato de cabeçalho o novo cabeçalho possuem tamanho fixo, totalizando 64 bytes. Acelera bastante o processamento dos pacotes pelos\nroteadores"},{"term":"Version (4 bits):","definition":"Indica a versão do protocolo (IPv6)."},{"term":"Traffic Class (8 bits):","definition":"Diferenciação de serviços, similar ao Type of Service no IPv4"},{"term":"Flow Label (20 bits):","definition":"Usado para identificar fluxos de pacotes que requerem tratamento\nespecial."},{"term":"Payload Length (16 bits):","definition":"Comprimento do payload (dados) após o cabeçalho IPv6."},{"term":"Next Header (8 bits):","definition":"Indica o tipo do próximo cabeçalho (TCP, UDP, cabeçalho de extensão,\netc.)."},{"term":"Hop Limit (8 bits):","definition":"Número máximo de saltos que o pacote pode fazer (similar ao TTL no\nIPv4)"},{"term":"Options (variável):","definition":"opções adicionais"},{"term":"Padding (variável):","definition":"Preenchimento para alinhar o cabeçalho."},{"term":"Checksum:","definition":"A função do campo de Checksum era detectar erros que afetassem ao cabeçalho IP, sem detectar, no entanto, erros no restante do pacote,Como os roteadores só alteram o campo Hop Limit (Time- to-live no IPv4), estes então terminam por recalcular o Checksum antes de retransmitir o pacote, o que pode causar a não detecção de possíveis erros."},{"term":"ICMPv6","definition":"ICMPv6 (Internet Control Message Protocol) é uma versão atualizada do protocolo ICMPv4 para ser utilizada em conjunto com o IPv6. é obrigatória em todos os nós da rede que utilizam IPv6 para se comunicar."},{"term":"ICMPv6","definition":"ICMPv6 assume funções de outros protocolos, que existem isoladamente no IPv4.\nTal mudança foi projetada com o simples intuito de reduzir a multiplicidade de protocolos, que é prejudicial por piorar a coerência e aumentar o tamanho das implementações. Os protocolos usados no IPv4, que não existem mais no IPv6"},{"term":"ARP (Address Resolution Protocol","definition":"cujo o objetivo é mapear os endereços físicos através dos endereços lógicos;"},{"term":"RARP (Reverse Address Resolution Protocol)","definition":"realiza o inverso do ARP, mapeando os endereços lógicos para endereços físicos;"},{"term":"IGMP (Internet Group Management Protocol)","definition":"IGMP (Internet Group Management Protocol)"},{"term":"ARP e RARP","definition":"no IPv4, são protocolos que podem ser descritos como operando entre as camadas 2 e 3 do modelo ISO/OSI., eles não dependem de pacotes IP. O ICMPv6 é um protocolo de camada 3, mas é encapsulado em um pacote IP.podem bloquear funções extremamente básicas como a descoberta dos vizinhos e a autoconfiguração."},{"term":"MLD (Multicast Listener Discovery)","definition":"Que opera com o gerenciamento dos grupos Multicast;"},{"term":"NDP (Neighbor Discovery Protocol)","definition":"responsável por identificar e conhecer características da vizinhança;"},{"term":"Path MTU Discovery","definition":"que trabalha no processo de descoberta do menor MTU em comunicação entre dois nós"},{"term":"Mobility support","definition":"cuida do gerenciamento de endereços de origem dos hosts dinamicamente;"},{"term":"ICMPv6//IPv4.","definition":"o ICMPv6 é muito mais importante para o funcionamento do IPv6, do que o ICMP é para o funcionamento do IPv4."},{"term":"Estrutura de Endereços IPv6:","definition":". Eles são representados em notação hexadecimal e são organizados em grupos de quatro dígitos separados por dois pontos, por exemplo, 2001:0db8:85a3:0000:0000:8a2e:0370:7334. Além disso, o IPv6 introduz endereços especiais, como os endereços loopback (::1) e de link local (fe80::), que têm papéis específicos na\ncomunicação."},{"term":"Benefícios Além dos Endereços","definition":"A autoconfiguração de endereços permite que dispositivos conectados obtenham automaticamente um endereço IPv6 válido sem a necessidade de um servidor DHCP."}]